<a href="https://colab.research.google.com/github/azarcoder/gcollab/blob/main/pandas_leetcode.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
student_data= \
[
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]
df = pd.DataFrame(student_data, columns=['student_id', 'age'])
print(df)

print(df.shape)

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20
(4, 2)

In [ ]:
data = {
    'student_id' : [101, 53, 128, 3],
    'name' : ['Ulysses', 'William', 'Henry', 'Henry'],
    'age' : [13, 10, 6, 11]
}

df = pd.DataFrame(data)
print(df.loc[df['student_id'] == 101, ['name', 'age']])

      name  age
0  Ulysses   13

In [ ]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 17, 22],
    'Salary' : [2000, 4000, 6000]
})

# Add a column
df['Bonus'] = df['Salary'] * 2

print(df)

      Name  Age  Salary  Bonus
0    Alice   25    2000   4000
1      Bob   17    4000   8000
2  Charlie   22    6000  12000

In [ ]:
#Drop Duplicate Rows
df = pd.DataFrame({
    'customer_id' : [1, 2, 3, 4, 5, 6],
    'name' : ['Ella', 'David', 'Zachary', 'Alice', 'Finn', 'Violet'],
    'email' : ['emily@example.com', 'michael@example.com', 'sarah@example.com', 'john@example.com', 'john@example.com', 'alice@example.com']
})
'''
subset: The column (or list of columns) to check for duplicates.

keep:

'first': keeps the first occurrence (default)

'last': keeps the last occurrence

False: drops all duplicates

inplace=True: updates the DataFrame in place.
'''
df.drop_duplicates(subset = 'email', keep = 'first', inplace = True)
print(df)

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

In [ ]:
#dropna(subset = 'column name', inplace = True)

#rename column
    # students.rename(columns = {
    #     'id': 'student_id',
    #     'first': 'first_name',
    #     'last' : 'last_name',
    #     'age': 'age_in_years'
    # }, inplace=True)
    # return students

    #concat
'''
    ignore_index=True: Resets the index after concat (only for axis=0)

    keys=['df1', 'df2']: Adds a hierarchical index

    axis=0: row-wise (default)

    axis=1: column-wise
'''


data1 = pd.DataFrame({
    'student_id' : [1,2,3,4],
    'name' : ['Mason', 'Ava', 'Taylor', 'Azar'],
    'age' : [8, 6, 15, 17]
})

data2 = pd.DataFrame({
    'student_id' : [5, 6],
    'name' : ['Leo', 'Alex'],
    'age' : [8, 9]
})

x = pd.concat([data1,data2], axis=0, ignore_index = True)
print(x)

   student_id    name  age
0           1   Mason    8
1           2     Ava    6
2           3  Taylor   15
3           4    Azar   17
4           5     Leo    8
5           6    Alex    9

In [ ]:
#pivot
weather = pd.DataFrame({
    'city': ['Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville',
             'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso'],
    'month': ['January', 'February', 'March', 'April', 'May',
              'January', 'February', 'March', 'April', 'May'],
    'temperature': [13, 23, 38, 5, 34, 20, 6, 26, 2, 43]
})

print(weather)
print('-'*40)
p = weather.pivot(index = 'month', columns = 'city', values = 'temperature')
print(p)
print('-'*40)
melted = pd.melt(weather, id_vars=['month'], var_name='city', value_name='temp')
print(melted)

df = pd.DataFrame({
    'product': ['Umbrella', 'SleepingBag'],
    'quarter_1': [417, 800],
    'quarter_2': [224, 936],
    'quarter_3': [379, 93],
    'quarter_4': [611, 875]
})

m = pd.melt(df, id_vars = ['product'], var_name = 'quarter', value_name='sales')
print(m)

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34
5        ElPaso   January           20
6        ElPaso  February            6
7        ElPaso     March           26
8        ElPaso     April            2
9        ElPaso       May           43
----------------------------------------
city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34
----------------------------------------
       month         city          temp
0    January         city  Jacksonville
1   February         city  Jacksonville
2      March         city  Jacksonville
3      April         city  Jacksonville
4        May         city  Jacksonville
5    January         city        ElPaso
6   February         city        ElPaso
7      March         city        ElPaso
8      April         city        ElPaso
9        May         city        ElPaso
10   January  temperature            13
11  February  temperature            23
12     March  temperature            38
13     April  temperature             5
14       May  temperature            34
15   January  temperature            20
16  February  temperature             6
17     March  temperature            26
18     April  temperature             2
19       May  temperature            43
       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

In [ ]:
#chaining
df = pd.DataFrame({
    'name': ['Tatiana', 'Khaled', 'Alex', 'Jonathan', 'Stefan', 'Tommy'],
    'species': ['Snake', 'Giraffe', 'Leopard', 'Monkey', 'Bear', 'Panda'],
    'age': [98, 50, 6, 45, 100, 26],
    'weight': [464, 41, 328, 463, 50, 349]
})

print(df)
print('-'*40)

r = df[df['weight'] > 100].sort_values(by = 'weight', ascending = False)[['name']]
print(r)

       name  species  age  weight
0   Tatiana    Snake   98     464
1    Khaled  Giraffe   50      41
2      Alex  Leopard    6     328
3  Jonathan   Monkey   45     463
4    Stefan     Bear  100      50
5     Tommy    Panda   26     349
----------------------------------------
       name
0   Tatiana
3  Jonathan
5     Tommy
2      Alex